# 문자열 포맷팅

# f"문자열 포맷팅"

a = 12345
b = 'hello'
c = 3.14159

print(f"기본: ({a})")
print(f"기본: ({b})")
print(f"기본: ({c})")

print(f"정렬: ({a:10})")   # (     12345)
print(f"정렬: ({a:<10})")  # (12345     )
print(f"정렬: ({a:^10})")  # (  12345   )
print(f"정렬: ({a:>10})")  # (     12345)
print(f"정렬: ({a:>10d})") # (     12345)

print(f"정렬: ({b:10})")  # (hello     )
print(f"정렬: ({b:<10})") # (hello     )
print(f"정렬: ({b:^10})") # (  hello   )
print(f"정렬: ({b:>10})") # (     hello)

print(f"실수: ({c:10})")     # (   3.14159)
print(f"실수: ({c:10f})")    # (  3.141590)
print(f"실수: ({c:10.3f})")  # (     3.142)
print(f"실수: ({c:<10.3f})") # (3.142     )
print(f"실수: ({c:^10.3f})") # (  3.142   )
print(f"실수: ({c:>10.3f})") # (     3.142)
print(f"실수: ({c:>10.3})")  # (      3.14)





